#1.input():接收用户输入，input得到的数据永远是字符串
name=input("请输入名字：")
print("名字是："+name)

#所以做数学运算前通常要转换类型
a = int(input("请输入第一个数字：")) #10
b = int(input("请输入第二个数字：")) #20

print(a + b) #30

#如果不做类型转换
a = input("a：")#10
b = input("b：")#20

print(a + b) #输出1020，字符串的+是拼接

#2.算数运算符
"""
| 运算符  | 含义 | 示例     |     结果 |
| ----   | -- | --------- | ---------: |
| `+`    | 加  | `10 + 3` |       `13` |
| `-`    | 减  | `10 - 3`  |        `7` |
| `*`    | 乘  | `10 * 3`  |       `30` |
| `/`    | 除  | `10 / 3`  | `3.333...` |
| `//`   | 整除 | `10 // 3` |        `3` |
| `%`    | 取余 | `10 % 3`  |        `1` |
| `**`   | 幂  | `2 ** 3`  |        `8` |

"""

#3.比较运算符
'''
| 运算符  | 含义   | 示例       |
| ---- | ---- | -------- |
| `==` | 等于   | `a == b` |
| `!=` | 不等于  | `a != b` |
| `>`  | 大于   | `a > b`  |
| `<`  | 小于   | `a < b`  |
| `>=` | 大于等于 | `a >= b` |
| `<=` | 小于等于 | `a <= b` |

'''

#4.逻辑运算符
'''
and
or
not

'''
#5.运算符优先级
'''
()
↓
**
↓
* / // %
↓
+ -
↓
> < >= <= == !=
↓
not
↓
and
↓
or
'''

#6.f-string，核心结构：f"文字{变量}文字"，f不能忘
name="wzr"
age=23
print(f"我的名字是{name},今年{age}岁")

#f-string中也可以直接计算
a = 10
b = 20

print(f"a + b = {a + b}")

#7.f-string控制小数位数
piece=3.1415926
print(f"piece = {piece:.2f}")#输出3.14， .2f的含义是保留两位小数

